# RgbRParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RgbRParam Property
ParameterTypeId Class See Also
---
"Red value for RGB color spec. (for Use with XAML Data Template example)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RgbRParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RgbRParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RgbRParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace